{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "9ace4d03",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2023-07-20T06:24:49.023535Z",
     "start_time": "2023-07-20T06:24:48.344582300Z"
    }
   },
   "outputs": [],
   "source": [
    "import json\n",
    "import csv\n",
    "import pandas as pd\n",
    "from py2neo import Graph\n",
    "import pandas as pd\n",
    "pd.set_option('display.max_rows', None)\n",
    "pd.set_option('display.max_columns', None)\n",
    "import random as rd"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "357866dd",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2023-07-20T06:29:11.640950Z",
     "start_time": "2023-07-20T06:29:11.617725200Z"
    }
   },
   "outputs": [],
   "source": [
    "# Establish a connection to the Neo4j database\n",
    "graph = Graph(\"bolt://localhost:7687\", auth=(\"user_name\", \"user_password\"))\n",
    "# Generate random integers for graph names\n",
    "rd_int1 = rd.randint(1,500)\n",
    "rd_int2 = rd.randint(500,9999)\n",
    "# Create graph names\n",
    "graph1 = 'g' + str(rd_int1)\n",
    "graph2 = 'g' + str(rd_int2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "6e622ef7",
   "metadata": {
    "scrolled": true,
    "ExecuteTime": {
     "end_time": "2023-07-20T06:24:57.203370800Z",
     "start_time": "2023-07-20T06:24:57.183713200Z"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "                                   현수교 교량공사 안전보건작업 지침\n",
      "0                     소규모 철근콘크리트 교량공사 거푸집 동바리 안전작업 지침\n",
      "1                         교량공사의 이동식 비계공법(MSS) 안전작업 지침\n",
      "2                                      낙하물 방호선반 설치 지침\n",
      "3                            흙막이공사(엄지말뚝 공법) 안전보건작업 지침\n",
      "4                철골공사 무지보 거푸집동바리(데크플레이트 공법) 안전보건작업 지침\n",
      "5                    흙막이공사(Soil Nailing 공법) 안전보건작업 지침\n",
      "6                    흙막이공사(Earth Anchor 공법) 안전보건작업 지침\n",
      "7                          관로매설공사(유압식 추진공법) 안전보건작업 지침\n",
      "8                                   취약시기 건설현장 안전작업 지침\n",
      "9                  해상 RCD 현장타설 말뚝공사(현수교, 사장교) 안전작업 지침\n",
      "10                               PCT거더 교량공사 안전보건작업 지침\n",
      "11                               트러스거더 교량공사 안전보건작업 지침\n",
      "12                               덤프트럭 및 화물자동차 안전작업 지침\n",
      "13                                       강관비계 안전작업 지침\n",
      "14                                   조적공사 안전보건작업 기술지침\n",
      "15                        중소규모 건설업체 본사의 안전보건관리에 관한 지침\n",
      "16                                   수직형 추락방망 설치 기술지침\n",
      "17                         건설현장 용접용단 작업시 안전보건작업 기술지침\n",
      "18                                      낙하물 방지망 설치 지침\n",
      "19                               F.C.M 교량공사 안전보건작업 지침\n",
      "20                                     미장공사 안전보건작업 지침\n",
      "21                           탑다운(Top down) 공법 안전작업 지침\n",
      "22                            이동식 크레인 양중작업의 안정성 검토 지침\n",
      "23                           초고층 건축물공사(화재예방) 안전보건작업지침\n",
      "24                           초고층 건축물공사(일반사항) 안전보건작업지침\n",
      "25                                           안전대 사용지침\n",
      "26                         갱폼(Gang form) 제작 및 사용안전 지침\n",
      "27                                  작업의자형 달비계 안전작업 지침\n",
      "28                                     시스템 비계 안전작업 지침\n",
      "29                                      건설기계 안전보건작업지침\n",
      "30                                  이동식 크레인 안전보건작업 지침\n",
      "31                                    지붕공사 안전보건작업 기술지\n",
      "32                        시스템폼(RCS폼, ACS폼 중심) 안전작업 지침\n",
      "33                                 사장교 교량공사 안전보건작업 지침\n",
      "34                      프리캐스트 콘크리트 건축구조물 조립 안전보건작업 지침\n",
      "35                                   해체공사 안전보건작업 기술지침\n",
      "36                                       굴착공사 안전작업 지침\n",
      "37                                     철골공사 안전보건작업 지침\n",
      "38                                     발파공사 안전보건작업 지침\n",
      "39                               밀폐공간의 방수공사 안전보건작업 지침\n",
      "40                                  작업발판 설치 및 사용안전 지침\n",
      "41                              교량공사(P.S.M공법) 안전작업 지침\n",
      "42                               타일(Tile)공사 안전보건작업 지침\n",
      "43                              시트(Sheet)방수 안전보건작업 지침\n",
      "44                               I.L.M 교량공사 안전보건작업 지침\n",
      "45                                 지하매설물 굴착공사 안전작업 지침\n",
      "46                             슬립폼(Slip form) 안전작업 지침\n",
      "47                     프리스트레스트 콘크리트(PSC) 교량공사 안전작업 지침\n",
      "48                                  야간 건설공사 안전보건작업 지침\n",
      "49                              이동식 비계 설치 및 사용안전 기술지침\n",
      "50                                경량철골 천장공사 안전보건작업 지침\n",
      "51                                    내장공사의 안전보건작업 지침\n",
      "52                            블록식 보강토 옹벽 공사 안전보건작업 지침\n",
      "53                                      굴착기 안전보건작업 지침\n",
      "54                              항타기·항발기 사용 작업계획서 작성지침\n",
      "55                                     굴착공사 계측관리 기술지침\n",
      "56                                      철탑공사 안전보건기술지침\n",
      "57                      수상 바지(Barge)선 이용 건설공사 안전작업 지침\n",
      "58                                건설공사 돌관작업 안전보건작업 지침\n",
      "59                            아스팔트콘크리트 포장공사 안전보건작업 지침\n",
      "60                            가설계단의 설치 및 사용 안전보건작업 지침\n",
      "61                                        수직보호망 설치 지침\n",
      "62                                        추락방호망 설치 지침\n",
      "63                         교량 슬래브거푸집 해체용 작업대차 안전작업 지침\n",
      "64                                    시스템 동바리 안전작업 지침\n",
      "65                          화학플랜트 개․보수 공사 안전보건작업 기술지침\n",
      "66                                파이프 서포트 동바리 안전작업 지침\n",
      "67                       금속 커튼월(Curtain wall) 안전작업 지침\n",
      "68                                   리모델링 안전보건작업 기술지침\n",
      "69                         건축물의 석공사(내․외장) 안전보건작업 기술지침\n",
      "70                   가설구조물의 설계변경 요청 내용, 절차 등에 관한 작성지침\n",
      "71                  건설현장의 중량물 취급 작업계획서 (이동식 크레인) 작성지침\n",
      "72                               터널공사프론트 잭킹 안전보건 작업지침\n",
      "73                             흙막이공사SCW 공법의 안전보건 작업지침\n",
      "74                                    우물통기초의 안전보건작업지침\n",
      "75                         건설공사 굴착사면 안전기울기 기준에 관한 기술지\n",
      "76                                  교량공사라멘교 안전보건작업 지침\n",
      "77  흙막이공사띠장 긴장 공법, Prestressed Wale Method의 안전보건 작업지침\n",
      "78                                 관로매설공사 안전보건작업 기술지침\n",
      "79                           단순 슬래브 콘크리트 타설 안전보건작업 지침\n",
      "80                                 중소규모 관로공사의 안전보건작업지\n",
      "81                               흙막이공사지하연속벽 안전보건작업 지침\n",
      "82                            기성 콘크리트 파일 항타 안전보건작업 지침\n",
      "83                               건설공사의 고소작업대 안전보건작업지침\n",
      "84                               조경공사수목식재작업의 안전보건작업지침\n",
      "85                    흙막이공사강널말뚝, Sheet Pile의 안전보건작업지침\n",
      "86                             옹벽콘크리트 옹벽공사의 안전보건 작업지침\n"
     ]
    }
   ],
   "source": [
    "# Read data from a CSV file\n",
    "df = pd.read_csv('title_list.csv')\n",
    "print(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "d6839caf",
   "metadata": {
    "scrolled": true,
    "ExecuteTime": {
     "end_time": "2023-07-20T06:29:26.894263400Z",
     "start_time": "2023-07-20T06:29:14.633699700Z"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "파이프 서포트 동바리 안전작업 지침\n",
      "거푸집\n"
     ]
    }
   ],
   "source": [
    "# Prompt the user for input\n",
    "title = str(input(\"input Title : \"))\n",
    "index = str(input(\"input Index : \"))\n",
    "print(title)\n",
    "print(index)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "c0344736",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2023-07-20T06:29:29.853345600Z",
     "start_time": "2023-07-20T06:29:29.523085300Z"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'graph': 'g320', 'nodes': 38, 'rels': 1194}]\n"
     ]
    }
   ],
   "source": [
    "# Construct and execute a Cypher query to project a subgraph from graph1\n",
    "query1 = f'''CALL gds.graph.project.cypher('{graph1}','MATCH (n1:Index{{name:\"{index}\"}})--(n2:Content)--(n3:Category)--(n4:Content{{Title:\"{title}\"}}) RETURN id(n4) AS id',\n",
    "  'MATCH (n4)-[r:Relate]-(n5:Content{{Title:\"{title}\"}}) RETURN id(n4) AS source, id(n5) AS target, type(r) AS type, count(r) AS numberOfReads',\n",
    "  {{ validateRelationships: false }}\n",
    ")\n",
    "YIELD graphName AS graph, nodeCount AS nodes, relationshipCount AS rels;'''\n",
    "result = graph.run(query1).data()\n",
    "print(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "cfad64ce",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2023-07-20T06:29:31.913260800Z",
     "start_time": "2023-07-20T06:29:31.858074Z"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'graph': 'g8941', 'nodes': 7098, 'rels': 1419}]\n"
     ]
    }
   ],
   "source": [
    "# Construct and execute a Cypher query to project a subgraph from graph2\n",
    "query2 = f'''MATCH (source)\n",
    "WHERE source:Content\n",
    "OPTIONAL MATCH (source:Content{{Title:\"{title}\"}})-[r:Include]->(target)\n",
    "WHERE target:Index WITH gds.alpha.graph.project(\n",
    "  '{graph2}',\n",
    "  source,\n",
    "  target,\n",
    "  {{\n",
    "    sourceNodeLabels: labels(source),\n",
    "    targetNodeLabels: labels(target)\n",
    "  }},\n",
    "  {{\n",
    "    relationshipType: type(r)\n",
    "  }}\n",
    ") AS g\n",
    "RETURN g.graphName AS graph, g.nodeCount AS nodes, g.relationshipCount AS rels'''\n",
    "result = graph.run(query2).data()\n",
    "print(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "d9067dc7",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2023-07-20T06:29:34.152990200Z",
     "start_time": "2023-07-20T06:29:34.049372300Z"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'nodePropertiesWritten': 38, 'ranIterations': 87}]\n"
     ]
    }
   ],
   "source": [
    "# Execute PageRank algorithm on graph1\n",
    "query3 = f'''CALL gds.pageRank.write('{graph1}',\n",
    "{{maxIterations: 100, dampingFactor: 0.85, writeProperty: '{graph1}'}})\n",
    "YIELD nodePropertiesWritten, ranIterations'''\n",
    "result = graph.run(query3).data()\n",
    "print(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "594f08f7",
   "metadata": {
    "scrolled": true,
    "ExecuteTime": {
     "end_time": "2023-07-20T06:29:39.035618800Z",
     "start_time": "2023-07-20T06:29:37.270899100Z"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'writeMillis': 51, 'nodePropertiesWritten': 7098, 'modularity': -0.04215963658414127, 'modularities': [-0.2028426255772733, -0.1817009765286475, -0.15850624838284016, -0.13947876423907696, -0.12097820726563539, -0.10547433129664316, -0.08726182122120962, -0.07175794525221736, -0.056958790918179326, -0.04215963658414127], 'ranLevels': 10, 'communityCount': 6863, 'communityDistribution': {'p99': 1, 'min': 1, 'max': 25, 'mean': 1.0342415853125455, 'p90': 1, 'p50': 1, 'p999': 11, 'p95': 1, 'p75': 1}, 'postProcessingMillis': 2, 'preProcessingMillis': 0, 'computeMillis': 1679, 'configuration': {'maxIterations': 10, 'writeConcurrency': 4, 'seedProperty': None, 'consecutiveIds': False, 'maxLevels': 10, 'concurrency': 4, 'jobId': '0e9a6650-936b-410b-b5ef-83758170860f', 'writeProperty': 'g8941', 'logProgress': True, 'includeIntermediateCommunities': False, 'nodeLabels': ['*'], 'sudo': False, 'relationshipTypes': ['*'], 'tolerance': 0.0001}}]\n"
     ]
    }
   ],
   "source": [
    "# Execute Louvain algorithm on graph2\n",
    "query4 = f'''call gds.louvain.write('{graph2}',{{writeProperty: '{graph2}'}})'''\n",
    "result = graph.run(query4).data()\n",
    "print(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "d0cdd872",
   "metadata": {
    "scrolled": true,
    "ExecuteTime": {
     "end_time": "2023-07-20T06:29:46.684663800Z",
     "start_time": "2023-07-20T06:29:46.610704900Z"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'n4': Node('Content', Category='일반안전사항', Content='재료, 기구 또는 공구 등을 올리거나 내리는 경우에는 건설장비 사용을 원착으로 하며, 부치나 길이가 작은 재료, 기구 또는 공구 등은 양중함이나 달줄ㆍ달포대 등을 사용하도록 하여야 한다.', Index=['건설장비', '건설장비 사용을', '경우에는', '경우에는 건설장비', '공구', '공구 등은', '공구 등을', '기구', '기구 또는', '길이가', '길이가 작은', '내리는', '내리는 경우에는', '달줄ㆍ달포대', '달줄ㆍ달포대 등을', '등은', '등은 양중함이나', '등을', '등을 사용하도록', '등을 올리거나', '또는', '또는 공구', '부치나', '부치나 길이가', '사용을', '사용을 원착으로', '사용하도록', '사용하도록 한다', '양중함이나', '양중함이나 달줄ㆍ달포대', '올리거나', '올리거나 내리는', '원착으로', '원착으로 하며', '작은', '작은 재료', '재료', '재료 기구', '하며', '하며 부치나', '한다'], Title='파이프 서포트 동바리 안전작업 지침', g320=1.0969486287836412, g5576=8102, g8668=8102, g8941=4950)}, {'n4': Node('Content', Category='일반안전사항', Content='파이프 서포트 동바리 재료는 고용노동부고시 제2020-33호(방호장치 안전인증 고시)에 적합한 것을 사용하여야 한다', Index=['33호', '33호 방호장치', '것을', '것을 사용하여야', '고시', '고시 적합한', '고용노동부고시', '고용노동부고시 제2020', '동바리', '동바리 재료는', '방호장치', '방호장치 안전인증', '사용하여야', '사용하여야 한다', '서포트', '서포트 동바리', '안전인증', '안전인증 고시', '재료는', '재료는 고용노동부고시', '적합한', '적합한 것을', '제2020', '제2020 33호', '파이프', '파이프 서포트', '한다'], Title='파이프 서포트 동바리 안전작업 지침', g320=1.064307507662366, g5576=8093, g8668=8093, g8941=4767)}, {'n4': Node('Content', Category='일반안전사항', Content='장선 및 멍에로 사용하는 목재는 구조용 목재를 사용하여야 하며, 원형 강관은 KS D 3566, 각형 강관은 KS D 3568, 경량 형강은 KS D 3530, 기타의 강재는 KS D 3503 또는 KS D 3515에 적합하여야 한다.', Index=['3503', '3503 또는', '3515에', '3515에 적합하여야', '3530', '3530 기타의', '3566', '3566 각형', '3568', '3568 경량', 'ks', 'ks 3503', 'ks 3515에', 'ks 3530', 'ks 3566', 'ks 3568', '각형', '각형 강관은', '강관은', '강관은 ks', '강재는', '강재는 ks', '경량', '경량 형강은', '구조용', '구조용 목재를', '기타의', '기타의 강재는', '또는', '또는 ks', '멍에로', '멍에로 사용하는', '목재는', '목재는 구조용', '목재를', '목재를 사용하여야', '사용하는', '사용하는 목재는', '사용하여야', '사용하여야 하며', '원형', '원형 강관은', '장선', '장선 멍에로', '적합하여야', '적합하여야 한다', '하며', '하며 원형', '한다', '형강은', '형강은 ks'], Title='파이프 서포트 동바리 안전작업 지침', g320=1.064307507662366, g5576=8098, g8668=8098, g8941=4868)}, {'n4': Node('Content', Category='일반안전사항', Content='거푸집 동바리 조립 및 해체작업 근로자는 산업안전보건법 제140조 및 유해⋅ 위험작업의 취업 제한에 관한 규칙에 의하여 기능습득교육을 받은 자 또는 동 등 이상의 자격을 갖춘 자 이어야 한다.', Index=['갖춘', '갖춘 이어야', '거푸집', '거푸집 동바리', '규칙에', '규칙에 의하여', '근로자는', '근로자는 산업안전보건법', '기능습득교육을', '기능습득교육을 받은', '동바리', '동바리 조립', '또는', '또는 이상의', '받은', '받은 또는', '산업안전보건법', '산업안전보건법 제140조', '위험작업의', '위험작업의 취업', '유해', '유해 위험작업의', '의하여', '의하여 기능습득교육을', '이상의', '이상의 자격을', '이어야', '이어야 한다', '자격을', '자격을 갖춘', '제140조', '제140조 유해', '제한에', '제한에 규칙에', '조립', '조립 해체작업', '취업', '취업 제한에', '한다', '해체작업', '해체작업 근로자는'], Title='파이프 서포트 동바리 안전작업 지침', g320=1.064307507662366, g5576=8103, g8668=8103, g8941=5029)}, {'n4': Node('Content', Category='일반안전사항', Content='재사용하는 파이프 서포트 동바리는 건설기술진흥법 제55조(건설공사의 품질관 리)에 적합한 것을 사용하여야 한다', Index=['건설공사의', '건설공사의 품질관', '건설기술진흥법', '건설기술진흥법 제55조', '것을', '것을 사용하여야', '동바리는', '동바리는 건설기술진흥법', '사용하여야', '사용하여야 한다', '서포트', '서포트 동바리는', '재사용하는', '재사용하는 파이프', '적합한', '적합한 것을', '제55조', '제55조 건설공사의', '파이프', '파이프 서포트', '품질관', '품질관 적합한', '한다'], Title='파이프 서포트 동바리 안전작업 지침', g320=1.064307507662366, g5576=8094, g8668=8094, g8941=4767)}, {'n4': Node('Content', Category='일반안전사항', Content='높이 5 m 이상인 거푸집 동바리 및 발주자 또는 인허가기관의 장이 필요하다 고 인정한 거푸집 동바리는 건설기술진흥법 시행령 제101조2에 따라 시공전 관 계전문가(기술사법에 등록된 자로 수급인에게 고용되지 않은 구조기술사)로부 터 구조적 안전성을 확인받아야 한다.', Index=['거푸집', '거푸집 동바리', '거푸집 동바리는', '건설기술진흥법', '건설기술진흥법 시행령', '계전문가', '계전문가 기술사법에', '고용되지', '고용되지 않은', '구조기술사', '구조기술사 로부', '구조적', '구조적 안전성을', '기술사법에', '기술사법에 등록된', '높이', '높이 이상인', '동바리', '동바리 발주자', '동바리는', '동바리는 건설기술진흥법', '등록된', '등록된 자로', '또는', '또는 인허가기관의', '로부', '로부 구조적', '발주자', '발주자 또는', '수급인에게', '수급인에게 고용되지', '시공전', '시공전 계전문가', '시행령', '시행령 제101조2에', '안전성을', '안전성을 확인받아야', '않은', '않은 구조기술사', '이상인', '이상인 거푸집', '인정한', '인정한 거푸집', '인허가기관의', '인허가기관의 장이', '자로', '자로 수급인에게', '장이', '장이 필요하다', '제101조2에', '제101조2에 시공전', '필요하다', '필요하다 인정한', '한다', '확인받아야', '확인받아야 한다'], Title='파이프 서포트 동바리 안전작업 지침', g320=1.064307507662366, g5576=8100, g8668=8100, g8941=4930)}, {'n4': Node('Content', Category='일반안전사항', Content='장선 및 멍에는 거푸집 널과 원활히 결합될 수 있는 재료나 결합방식을 고려하여 선정하여야 한다', Index=['거푸집', '거푸집 널과', '결합될', '결합될 있는', '결합방식을', '결합방식을 고려하여', '고려하여', '고려하여 선정하여야', '널과', '널과 원활히', '멍에는', '멍에는 거푸집', '선정하여야', '선정하여야 한다', '원활히', '원활히 결합될', '있는', '있는 재료나', '장선', '장선 멍에는', '재료나', '재료나 결합방식을', '한다'], Title='파이프 서포트 동바리 안전작업 지침', g320=1.0324045709364087, g5576=8097, g8668=8097, g8941=4950)}, {'n4': Node('Content', Category='일반안전사항', Content='파이프 서포트 동바리는 구조를 검토한 후 조립도를 작성하고, 조립도에 따라 조 립하여야 한다', Index=['검토한', '검토한 조립도를', '구조를', '구조를 검토한', '동바리는', '동바리는 구조를', '립하여야', '립하여야 한다', '서포트', '서포트 동바리는', '작성하고', '작성하고 조립도에', '조립도를', '조립도를 작성하고', '조립도에', '조립도에 립하여야', '파이프', '파이프 서포트', '한다'], Title='파이프 서포트 동바리 안전작업 지침', g320=1.064307507662366, g5576=8099, g8668=8099, g8941=4950)}, {'n4': Node('Content', Category='일반안전사항', Content='파이프 서포트 동바리 재료는 변형ㆍ부식 또는 심하게 손상된 것을 사용해서 는 아니 된다', Index=['것을', '것을 사용해서', '동바리', '동바리 재료는', '된다', '또는', '또는 심하게', '변형ㆍ부식', '변형ㆍ부식 또는', '사용해서', '사용해서 된다', '서포트', '서포트 동바리', '손상된', '손상된 것을', '심하게', '심하게 손상된', '재료는', '재료는 변형ㆍ부식', '파이프', '파이프 서포트'], Title='파이프 서포트 동바리 안전작업 지침', g320=0.5257149006944122, g5576=8095, g8668=8095, g8941=4767)}, {'n4': Node('Content', Category='일반안전사항', Content='조립도에는 동바리ㆍ멍에 등 부재의 재질ㆍ단면규격ㆍ설치간격 및 이음방법 등을 명시하여야 한다', Index=['동바리ㆍ멍에', '동바리ㆍ멍에 부재의', '등을', '등을 명시하여야', '명시하여야', '명시하여야 한다', '부재의', '부재의 재질ㆍ단면규격ㆍ설치간격', '이음방법', '이음방법 등을', '재질ㆍ단면규격ㆍ설치간격', '재질ㆍ단면규격ㆍ설치간격 이음방법', '조립도에는', '조립도에는 동바리ㆍ멍에', '한다'], Title='파이프 서포트 동바리 안전작업 지침', g320=1.0324045709364087, g5576=8101, g8668=8101, g8941=4982)}, {'n4': Node('Content', Category='일반안전사항', Content='거푸집 동바리에 사용하는 동바리ㆍ멍에 등 주요 부분의 강재는 산업안전보건 기준에관한 규칙 별표 10의 기준에 적합한 것을 사용하여야 한다.', Index=['10의', '10의 기준에', '강재는', '강재는 산업안전보건', '거푸집', '거푸집 동바리에', '것을', '것을 사용하여야', '규칙', '규칙 별표', '기준에', '기준에 적합한', '기준에관한', '기준에관한 규칙', '동바리ㆍ멍에', '동바리ㆍ멍에 주요', '동바리에', '동바리에 사용하는', '별표', '별표 10의', '부분의', '부분의 강재는', '사용하는', '사용하는 동바리ㆍ멍에', '사용하여야', '사용하여야 한다', '산업안전보건', '산업안전보건 기준에관한', '적합한', '적합한 것을', '주요', '주요 부분의', '한다'], Title='파이프 서포트 동바리 안전작업 지침', g320=1.064307507662366, g5576=8096, g8668=8096, g8941=4767)}, {'n4': Node('Content', Category='동바리 해체작업 준수사항', Content='재료, 기구 또는 공구 등을 올리거나 내리는 소운반 작업은 근로자로 하여금 달 줄ㆍ달포대 등을 사용하도록 하여야 한다.', Index=['공구', '공구 등을', '근로자로', '근로자로 줄ㆍ달포대', '기구', '기구 또는', '내리는', '내리는 소운반', '등을', '등을 사용하도록', '등을 올리거나', '또는', '또는 공구', '사용하도록', '사용하도록 한다', '소운반', '소운반 작업은', '올리거나', '올리거나 내리는', '작업은', '작업은 근로자로', '재료', '재료 기구', '줄ㆍ달포대', '줄ㆍ달포대 등을', '한다'], Title='파이프 서포트 동바리 안전작업 지침', g320=1.064307507662366, g5576=8128, g8668=8128, g8941=4950)}, {'n4': Node('Content', Category='동바리 해체작업 준수사항', Content='거푸집 동바리 해체작업은 작업전 해체 시기 순서 등 해체작업 안전계획을 수 립하여야 한다.', Index=['거푸집', '거푸집 동바리', '동바리', '동바리 해체작업은', '립하여야', '립하여야 한다', '순서', '순서 해체작업', '시기', '시기 순서', '안전계획을', '안전계획을 립하여야', '작업전', '작업전 해체', '한다', '해체', '해체 시기', '해체작업', '해체작업 안전계획을', '해체작업은', '해체작업은 작업전'], Title='파이프 서포트 동바리 안전작업 지침', g320=1.105111229250402, g5576=8123, g8668=8123, g8941=5029)}, {'n4': Node('Content', Category='동바리 해체작업 준수사항', Content='해체 자재를 슬래브 위에 쌓아 놓는 경우에는 콘크리트 재령에 따른 허용하중 을 추정하여 분산 적치하여야 한다', Index=['경우에는', '경우에는 콘크리트', '놓는', '놓는 경우에는', '따른', '따른 허용하중', '분산', '분산 적치하여야', '슬래브', '슬래브 위에', '쌓아', '쌓아 놓는', '위에', '위에 쌓아', '자재를', '자재를 슬래브', '재령에', '재령에 따른', '적치하여야', '적치하여야 한다', '추정하여', '추정하여 분산', '콘크리트', '콘크리트 재령에', '한다', '해체', '해체 자재를', '허용하중', '허용하중 추정하여'], Title='파이프 서포트 동바리 안전작업 지침', g320=1.1058485517872316, g5576=8130, g8668=8130, g8941=5834)}, {'n4': Node('Content', Category='동바리 해체작업 준수사항', Content='비, 눈, 그 밖의 기상상태의 불안정으로 날씨가 몹시 나쁜 경우에는 그 작업을 중지하여야 한다', Index=['경우에는', '경우에는 작업을', '기상상태의', '기상상태의 불안정으로', '나쁜', '나쁜 경우에는', '날씨가', '날씨가 몹시', '몹시', '몹시 나쁜', '밖의', '밖의 기상상태의', '불안정으로', '불안정으로 날씨가', '작업을', '작업을 중지하여야', '중지하여야', '중지하여야 한다', '한다'], Title='파이프 서포트 동바리 안전작업 지침', g320=1.0650443163855818, g5576=8127, g8668=8127, g8941=5786)}, {'n4': Node('Content', Category='동바리 해체작업 준수사항', Content='해체한 자재는 신속하게 반출하여 작업공간을 확보하고, 안전한 장소에 적재적 재하여야 한다.', Index=['반출하여', '반출하여 작업공간을', '신속하게', '신속하게 반출하여', '안전한', '안전한 장소에', '자재는', '자재는 신속하게', '작업공간을', '작업공간을 확보하고', '장소에', '장소에 적재적', '재하여야', '재하여야 한다', '적재적', '적재적 재하여야', '한다', '해체한', '해체한 자재는', '확보하고', '확보하고 안전한'], Title='파이프 서포트 동바리 안전작업 지침', g320=1.0324045709364087, g5576=8129, g8668=8129, g8941=5814)}, {'n4': Node('Content', Category='동바리 해체작업 준수사항', Content='해체 작업 구역에는 당해 작업에 종사하는 근로자 및 관련자 이외에는출입을  금지를 위하여 출입금지 안전표지를 부착하여야 한다.', Index=['관련자', '관련자 이외에는출입을', '구역에는', '구역에는 당해', '근로자', '근로자 관련자', '금지를', '금지를 출입금지', '당해', '당해 작업에', '부착하여야', '부착하여야 한다', '안전표지를', '안전표지를 부착하여야', '이외에는출입을', '이외에는출입을 금지를', '작업', '작업 구역에는', '작업에', '작업에 종사하는', '종사하는', '종사하는 근로자', '출입금지', '출입금지 안전표지를', '한다', '해체', '해체 작업'], Title='파이프 서포트 동바리 안전작업 지침', g320=1.0324045709364087, g5576=8126, g8668=8126, g8941=5760)}, {'n4': Node('Content', Category='동바리 해체작업 준수사항', Content='해체 시기⋅범위 및 절차 등의 해체작업 안전계획은 해체작업 근로자에게 교육 하여야 한다', Index=['교육', '교육 한다', '근로자에게', '근로자에게 교육', '등의', '등의 해체작업', '범위', '범위 절차', '시기', '시기 범위', '안전계획은', '안전계획은 해체작업', '절차', '절차 등의', '한다', '해체', '해체 시기', '해체작업', '해체작업 근로자에게', '해체작업 안전계획은'], Title='파이프 서포트 동바리 안전작업 지침', g320=1.0324045709364087, g5576=8125, g8668=8125, g8941=5029)}, {'n4': Node('Content', Category='동바리 조립작업 준수사항', Content='지반에 설치하는 동바리는 강우로 인하여 토사가 씻겨나가지 않도록 보호하여 야 한다.', Index=['강우로', '강우로 인하여', '동바리는', '동바리는 강우로', '보호하여', '보호하여 한다', '설치하는', '설치하는 동바리는', '씻겨나가지', '씻겨나가지 않도록', '않도록', '않도록 보호하여', '인하여', '인하여 토사가', '지반에', '지반에 설치하는', '토사가', '토사가 씻겨나가지', '한다'], Title='파이프 서포트 동바리 안전작업 지침', g320=1.0324045709364087, g5576=8106, g8668=8106, g8941=4950)}, {'n4': Node('Content', Category='동바리 조립작업 준수사항', Content='강관 파이프 서포트 동바리로 대체하여 사용하는 경우에는 다음 사항을 준수하 여야 한다. 가. 높이 2미터 이내마다 수평연결재를 2개 방향으로 설치하고 수평연결재의 변위 를 방지할 것 나. 멍에 등을 상단에 올릴 경우에는 해당 상단에 강재의 단판을 붙여 멍에 등을 고정시킬 것', Index=['2개', '2개 방향으로', '2미터', '2미터 이내마다', '강관', '강관 파이프', '강재의', '강재의 단판을', '경우에는', '경우에는 사항을', '경우에는 해당', '고정시킬', '높이', '높이 2미터', '단판을', '단판을 붙여', '대체하여', '대체하여 사용하는', '동바리로', '동바리로 대체하여', '등을', '등을 고정시킬', '등을 상단에', '멍에', '멍에 등을', '방지할', '방지할 멍에', '방향으로', '방향으로 설치하고', '변위', '변위 방지할', '붙여', '붙여 멍에', '사용하는', '사용하는 경우에는', '사항을', '사항을 준수하', '상단에', '상단에 강재의', '상단에 올릴', '서포트', '서포트 동바리로', '설치하고', '설치하고 수평연결재의', '수평연결재를', '수평연결재를 2개', '수평연결재의', '수평연결재의 변위', '여야', '여야 한다', '올릴', '올릴 경우에는', '이내마다', '이내마다 수평연결재를', '준수하', '준수하 여야', '파이프', '파이프 서포트', '한다', '한다 높이', '해당', '해당 상단에'], Title='파이프 서포트 동바리 안전작업 지침', g320=1.1831482513462148, g5576=8111, g8668=8111, g8941=4950)}, {'n4': Node('Content', Category='동바리 조립작업 준수사항', Content='동바리를 지반에 설치하는 경우에는 침하를 방지하기 위하여 콘크리트를 타설 하거나, 두께 45 mm 이상의 깔목, 깔판, 전용 받침 철물, 받침판 등을 설치하여 야 한다', Index=['45', '45 mm', 'mm', 'mm 이상의', '경우에는', '경우에는 침하를', '깔목', '깔목 깔판', '깔판', '깔판 전용', '동바리를', '동바리를 지반에', '두께', '두께 45', '등을', '등을 설치하여', '받침', '받침 철물', '받침판', '받침판 등을', '방지하기', '방지하기 콘크리트를', '설치하는', '설치하는 경우에는', '설치하여', '설치하여 한다', '이상의', '이상의 깔목', '전용', '전용 받침', '지반에', '지반에 설치하는', '철물', '철물 받침판', '침하를', '침하를 방지하기', '콘크리트를', '콘크리트를 타설', '타설', '타설 하거나', '하거나', '하거나 두께', '한다'], Title='파이프 서포트 동바리 안전작업 지침', g320=1.0650443163855818, g5576=8105, g8668=8105, g8941=5087)}, {'n4': Node('Content', Category='동바리 조립작업 준수사항', Content='동바리의 상·하 고정 및 미끄러짐 방지 조치를 하고, 하중의 지지상태를 유지하 여야 한다.', Index=['고정', '고정 미끄러짐', '동바리의', '동바리의 고정', '미끄러짐', '미끄러짐 방지', '방지', '방지 조치를', '여야', '여야 한다', '유지하', '유지하 여야', '조치를', '조치를 하고', '지지상태를', '지지상태를 유지하', '하고', '하고 하중의', '하중의', '하중의 지지상태를', '한다'], Title='파이프 서포트 동바리 안전작업 지침', g320=1.0650443163855818, g5576=8108, g8668=8108, g8941=5161)}, {'n4': Node('Content', Category='동바리 조립작업 준수사항', Content='경사면 하부에 조립하는 거푸집 동바리는 다음 사항을 준수하여야 한다. 가. 거푸집의 형상에 따른 부득이한 경우를 제외하고는 깔판ㆍ깔목 등을 2단 이상 끼우지 않도록 할 것 나. 깔판ㆍ깔목 등을 이어서 사용하는 경우에는 깔판ㆍ깔목은 단단히 연결할 것 다. 경사면에 설치하는 동바리는 연직도를 유지하도록 깔판ㆍ깔목 등으로 고정할 것 라. 연직하게 설치되는 동바리는 경사면방향 분력으로 인하여 미끄러짐 및 전도가 발생할 수 있으므로 모든 동바리에 가새를 설치하는 등 안전조치할 것.', Index=['2단', '2단 끼우지', '가새를', '가새를 설치하는', '거푸집', '거푸집 동바리는', '거푸집의', '거푸집의 형상에', '경사면', '경사면 하부에', '경사면방향', '경사면방향 분력으로', '경사면에', '경사면에 설치하는', '경우를', '경우를 제외하고는', '경우에는', '경우에는 깔판ㆍ깔목은', '고정할', '고정할 연직하게', '깔판ㆍ깔목', '깔판ㆍ깔목 등으로', '깔판ㆍ깔목 등을', '깔판ㆍ깔목은', '깔판ㆍ깔목은 단단히', '끼우지', '끼우지 않도록', '단단히', '단단히 연결할', '동바리는', '동바리는 경사면방향', '동바리는 사항을', '동바리는 연직도를', '동바리에', '동바리에 가새를', '등으로', '등으로 고정할', '등을', '등을 2단', '등을 사용하는', '따른', '따른 부득이한', '모든', '모든 동바리에', '미끄러짐', '미끄러짐 전도가', '발생할', '발생할 있으므로', '부득이한', '부득이한 경우를', '분력으로', '분력으로 인하여', '사용하는', '사용하는 경우에는', '사항을', '사항을 준수하여야', '설치되는', '설치되는 동바리는', '설치하는', '설치하는 동바리는', '설치하는 안전조치할', '안전조치할', '않도록', '않도록 깔판ㆍ깔목', '연결할', '연결할 경사면에', '연직도를', '연직도를 유지하도록', '연직하게', '연직하게 설치되는', '유지하도록', '유지하도록 깔판ㆍ깔목', '인하여', '인하여 미끄러짐', '있으므로', '있으므로 모든', '전도가', '전도가 발생할', '제외하고는', '제외하고는 깔판ㆍ깔목', '조립하는', '조립하는 거푸집', '준수하여야', '준수하여야 한다', '하부에', '하부에 조립하는', '한다', '한다 거푸집의', '형상에', '형상에 따른'], Title='파이프 서포트 동바리 안전작업 지침', g320=1.0650443163855818, g5576=8114, g8668=8114, g8941=4950)}, {'n4': Node('Content', Category='동바리 조립작업 준수사항', Content='파이프 서포트 동바리는 다음 사항을 준수하여야 한다. 가. 파이프 서포트를 3개 이상 이어서 사용하지 않도록 할 것 나. 파이프 서포트를 이어서 사용하는 경우에는 4개 이상의 볼트 또는 전용철물을 사용하여 이을 것 다. 높이가 3.5미터를 초과하는 경우에는 높이 2미터 이내마다 비계용 강관을 사용  하여 수평연결재를 2개 방향으로 설치하고 수평연결재의 변위를 방지하기 위 하여 비계용 클램프로 체결할 것', Index=['2개', '2개 방향으로', '2미터', '2미터 이내마다', '3개', '3개 사용하지', '4개', '4개 이상의', '5미터를', '5미터를 초과하는', '강관을', '강관을 사용', '경우에는', '경우에는 4개', '경우에는 높이', '높이', '높이 2미터', '높이가', '높이가 5미터를', '동바리는', '동바리는 사항을', '또는', '또는 전용철물을', '방지하기', '방지하기 하여', '방향으로', '방향으로 설치하고', '변위를', '변위를 방지하기', '볼트', '볼트 또는', '비계용', '비계용 강관을', '비계용 클램프로', '사용', '사용 하여', '사용하는', '사용하는 경우에는', '사용하여', '사용하여 이을', '사용하지', '사용하지 않도록', '사항을', '사항을 준수하여야', '서포트', '서포트 동바리는', '서포트를', '서포트를 3개', '서포트를 사용하는', '설치하고', '설치하고 수평연결재의', '수평연결재를', '수평연결재를 2개', '수평연결재의', '수평연결재의 변위를', '않도록', '않도록 파이프', '이내마다', '이내마다 비계용', '이상의', '이상의 볼트', '이을', '이을 높이가', '전용철물을', '전용철물을 사용하여', '준수하여야', '준수하여야 한다', '체결할', '초과하는', '초과하는 경우에는', '클램프로', '클램프로 체결할', '파이프', '파이프 서포트', '파이프 서포트를', '하여', '하여 비계용', '하여 수평연결재를', '한다', '한다 파이프'], Title='파이프 서포트 동바리 안전작업 지침', g320=1.1831482513462148, g5576=8112, g8668=8112, g8941=4950)}, {'n4': Node('Content', Category='동바리 조립작업 준수사항', Content='거푸집이 곡면인 경우에는 버팀대의 부착 등 그 거푸집의 부상(浮上)을 방지하 기 위한 조치를 할 것', Index=['浮上', '浮上 방지하', '거푸집의', '거푸집의 부상', '거푸집이', '거푸집이 곡면인', '경우에는', '경우에는 버팀대의', '곡면인', '곡면인 경우에는', '방지하', '방지하 위한', '버팀대의', '버팀대의 부착', '부상', '부상 浮上', '부착', '부착 거푸집의', '위한', '위한 조치를', '조치를'], Title='파이프 서포트 동바리 안전작업 지침', g320=0.4997144916552716, g5576=8110, g8668=8110, g8941=5196)}, {'n4': Node('Content', Category='동바리 조립작업 준수사항', Content='개구부 상부에 동바리를 설치하는 경우에는 상부하중을 견딜 수 있는 견고한 받침대를 설치하여야 한다.', Index=['개구부', '개구부 상부에', '견고한', '견고한 받침대를', '견딜', '견딜 있는', '경우에는', '경우에는 상부하중을', '동바리를', '동바리를 설치하는', '받침대를', '받침대를 설치하여야', '상부에', '상부에 동바리를', '상부하중을', '상부하중을 견딜', '설치하는', '설치하는 경우에는', '설치하여야', '설치하여야 한다', '있는', '있는 견고한', '한다'], Title='파이프 서포트 동바리 안전작업 지침', g320=1.0650443163855818, g5576=8107, g8668=8107, g8941=4950)}, {'n4': Node('Content', Category='동바리 조립작업 준수사항', Content='강재와 강재의 접속부 및 교차부는 볼트ㆍ클램프 등 전용철물을 사용하여 연 결할 것', Index=['강재와', '강재와 강재의', '강재의', '강재의 접속부', '결할', '교차부는', '교차부는 볼트ㆍ클램프', '볼트ㆍ클램프', '볼트ㆍ클램프 전용철물을', '사용하여', '사용하여 결할', '전용철물을', '전용철물을 사용하여', '접속부', '접속부 교차부는'], Title='파이프 서포트 동바리 안전작업 지침', g320=0.2058708849923209, g5576=8109, g8668=8109, g8941=5182)}, {'n4': Node('Content', Category='동바리 조립작업 준수사항', Content='층고가 4미터를 초과(단, 안전인증을 받은 동바리는 제외)하는 경우 및 콘크리 트 타설 두께가 1.0 미터를 초과하여 파이프 서포트로 설치가 어려울 경우와 파이프서포트 조립 간격이 너무 좁아 작업이 어려운 경우에는 하중을 안전하 게 지지할 수 있는 안전성을 확보할 수 있는 지지구조의 동바리 구조로 변경 하여야 한다.', Index=['4미터를', '4미터를 초과', '간격이', '간격이 너무', '경우', '경우 콘크리', '경우에는', '경우에는 하중을', '경우와', '경우와 파이프서포트', '구조로', '구조로 변경', '너무', '너무 좁아', '동바리', '동바리 구조로', '동바리는', '동바리는 제외', '두께가', '두께가 미터를', '미터를', '미터를 초과하여', '받은', '받은 동바리는', '변경', '변경 한다', '서포트로', '서포트로 설치가', '설치가', '설치가 어려울', '안전성을', '안전성을 확보할', '안전인증을', '안전인증을 받은', '안전하', '안전하 지지할', '어려운', '어려운 경우에는', '어려울', '어려울 경우와', '있는', '있는 안전성을', '있는 지지구조의', '작업이', '작업이 어려운', '제외', '제외 하는', '조립', '조립 간격이', '좁아', '좁아 작업이', '지지구조의', '지지구조의 동바리', '지지할', '지지할 있는', '초과', '초과 안전인증을', '초과하여', '초과하여 파이프', '층고가', '층고가 4미터를', '콘크리', '콘크리 타설', '타설', '타설 두께가', '파이프', '파이프 서포트로', '파이프서포트', '파이프서포트 조립', '하는', '하는 경우', '하중을', '하중을 안전하', '한다', '확보할', '확보할 있는'], Title='파이프 서포트 동바리 안전작업 지침', g320=1.0969486287836412, g5576=8113, g8668=8113, g8941=5314)}, {'n4': Node('Content', Category='콘크리트 타설작업 준수사항', Content='동절기 및 해빙기에 콘크리트 타설하는 경우에는 동바리가 동결된 지반 상부에 직접 설치되어졌는지를 확인하여 침하 등의 우려가 있는 경우 보수하여야 한다.', Index=['경우', '경우 보수하여야', '경우에는', '경우에는 동바리가', '동결된', '동결된 지반', '동바리가', '동바리가 동결된', '동절기', '동절기 해빙기에', '등의', '등의 우려가', '보수하여야', '보수하여야 한다', '상부에', '상부에 직접', '설치되어졌는지를', '설치되어졌는지를 확인하여', '우려가', '우려가 있는', '있는', '있는 경우', '지반', '지반 상부에', '직접', '직접 설치되어졌는지를', '침하', '침하 등의', '콘크리트', '콘크리트 타설하는', '타설하는', '타설하는 경우에는', '한다', '해빙기에', '해빙기에 콘크리트', '확인하여', '확인하여 침하'], Title='파이프 서포트 동바리 안전작업 지침', g320=1.1058485517872318, g5576=8117, g8668=8117, g8941=4950)}, {'n4': Node('Content', Category='콘크리트 타설작업 준수사항', Content='콘크리트 타설작업은 콘크리트 타설순서 등 타설계획을 수립하여야 한다.', Index=['수립하여야', '수립하여야 한다', '콘크리트', '콘크리트 타설순서', '콘크리트 타설작업은', '타설계획을', '타설계획을 수립하여야', '타설순서', '타설순서 타설계획을', '타설작업은', '타설작업은 콘크리트', '한다'], Title='파이프 서포트 동바리 안전작업 지침', g320=1.0732012286290207, g5576=8115, g8668=8115, g8941=5457)}, {'n4': Node('Content', Category='콘크리트 타설작업 준수사항', Content='콘크리트를 타설은 편심이 발생하지 않도록 골고루 분산하여 타설하여야 한다', Index=['골고루', '골고루 분산하여', '발생하지', '발생하지 않도록', '분산하여', '분산하여 타설하여야', '않도록', '않도록 골고루', '콘크리트를', '콘크리트를 타설은', '타설은', '타설은 편심이', '타설하여야', '타설하여야 한다', '편심이', '편심이 발생하지', '한다'], Title='파이프 서포트 동바리 안전작업 지침', g320=1.0324045709364087, g5576=8121, g8668=8121, g8941=5601)}, {'n4': Node('Content', Category='콘크리트 타설작업 준수사항', Content='콘크리트 타설작업은 작업전 거푸집 동바리의 변형ㆍ변위 및 지반의 침하 유무 등을 점검하고 이상이 있으면 보수하여야 한다', Index=['거푸집', '거푸집 동바리의', '동바리의', '동바리의 변형ㆍ변위', '등을', '등을 점검하고', '변형ㆍ변위', '변형ㆍ변위 지반의', '보수하여야', '보수하여야 한다', '유무', '유무 등을', '이상이', '이상이 있으면', '있으면', '있으면 보수하여야', '작업전', '작업전 거푸집', '점검하고', '점검하고 이상이', '지반의', '지반의 침하', '침하', '침하 유무', '콘크리트', '콘크리트 타설작업은', '타설작업은', '타설작업은 작업전', '한다'], Title='파이프 서포트 동바리 안전작업 지침', g320=1.0732012286290207, g5576=8118, g8668=8118, g8941=4950)}, {'n4': Node('Content', Category='콘크리트 타설작업 준수사항', Content='콘크리트 타설작업은 작업전 청소 실시하고 조립도 준수 여부를 확인하여야 한 다.', Index=['실시하고', '실시하고 조립도', '여부를', '여부를 확인하여야', '작업전', '작업전 청소', '조립도', '조립도 준수', '준수', '준수 여부를', '청소', '청소 실시하고', '콘크리트', '콘크리트 타설작업은', '타설작업은', '타설작업은 작업전', '확인하여야'], Title='파이프 서포트 동바리 안전작업 지침', g320=0.33793119191658744, g5576=8116, g8668=8116, g8941=5457)}, {'n4': Node('Content', Category='콘크리트 타설작업 준수사항', Content='감시자는 콘크리트 타설작업 중에 비정상적인 처짐이나 거푸집의 이탈이나 분 리, 모르타르의 누출, 이동, 경사, 침하, 접합부의 느슨해짐 등이 발생하는 경우 즉시 관리감독자에게 알려야 한다.', Index=['감시자는', '감시자는 콘크리트', '거푸집의', '거푸집의 이탈이나', '경사', '경사 침하', '경우', '경우 관리감독자에게', '관리감독자에게', '관리감독자에게 알려야', '누출', '누출 이동', '느슨해짐', '느슨해짐 등이', '등이', '등이 발생하는', '모르타르의', '모르타르의 누출', '발생하는', '발생하는 경우', '비정상적인', '비정상적인 처짐이나', '알려야', '알려야 한다', '이동', '이동 경사', '이탈이나', '이탈이나 모르타르의', '접합부의', '접합부의 느슨해짐', '중에', '중에 비정상적인', '처짐이나', '처짐이나 거푸집의', '침하', '침하 접합부의', '콘크리트', '콘크리트 타설작업', '타설작업', '타설작업 중에', '한다'], Title='파이프 서포트 동바리 안전작업 지침', g320=1.1058485517872318, g5576=8119, g8668=8119, g8941=5530)}, {'n4': Node('Content', Category='콘크리트 타설작업 준수사항', Content='콘크리트 펌프 또는 콘크리트 펌프카를 사용하는 경우에는 다음 사항을 준수하 여야 한다. 가. 작업 전 콘크리트 펌프용 비계 등 펌프 장비를 점검하고 이상을 발견하면 즉 시 보수할 것 나. 작업하는 근로자가 호스의 요동ㆍ선회로 인하여 떨어지는 위험을 방지하기 위 하여 안전난간 설치 또는 안전대 착용 등 떨어짐 방지 등 필요한 조치를 할 것 다. 콘크리트 펌프카의 붐을 조정하는 경우에는 주변의 전선 등에 의한 위험을 예 방하기 위한 적절한 조치를 할 것 라. 작업 중에 지반의 침하, 아웃트리거의 손상 등에 의하여 콘크리트 펌프카가 넘 어질 우려가 있는 경우에는 이를 방지하기 위한 적절한 조치를 할 것', Index=['경우에는', '경우에는 사항을', '경우에는 이를', '경우에는 주변의', '근로자가', '근로자가 호스의', '등에', '등에 의하여', '등에 의한', '떨어지는', '떨어지는 위험을', '떨어짐', '떨어짐 방지', '또는', '또는 안전대', '또는 콘크리트', '발견하면', '발견하면 보수할', '방지', '방지 필요한', '방지하기', '방지하기 위한', '방지하기 하여', '방하기', '방하기 위한', '보수할', '보수할 작업하는', '붐을', '붐을 조정하는', '비계', '비계 펌프', '사용하는', '사용하는 경우에는', '사항을', '사항을 준수하', '설치', '설치 또는', '손상', '손상 등에', '아웃트리거의', '아웃트리거의 손상', '안전난간', '안전난간 설치', '안전대', '안전대 착용', '어질', '어질 우려가', '여야', '여야 한다', '요동ㆍ선회로', '요동ㆍ선회로 인하여', '우려가', '우려가 있는', '위한', '위한 적절한', '위험을', '위험을 방지하기', '위험을 방하기', '의하여', '의하여 콘크리트', '의한', '의한 위험을', '이를', '이를 방지하기', '이상을', '이상을 발견하면', '인하여', '인하여 떨어지는', '있는', '있는 경우에는', '작업', '작업 중에', '작업 콘크리트', '작업하는', '작업하는 근로자가', '장비를', '장비를 점검하고', '적절한', '적절한 조치를', '전선', '전선 등에', '점검하고', '점검하고 이상을', '조정하는', '조정하는 경우에는', '조치를', '조치를 작업', '조치를 콘크리트', '주변의', '주변의 전선', '준수하', '준수하 여야', '중에', '중에 지반의', '지반의', '지반의 침하', '착용', '착용 떨어짐', '침하', '침하 아웃트리거의', '콘크리트', '콘크리트 펌프', '콘크리트 펌프용', '콘크리트 펌프카가', '콘크리트 펌프카를', '콘크리트 펌프카의', '펌프', '펌프 또는', '펌프 장비를', '펌프용', '펌프용 비계', '펌프카가', '펌프카가 어질', '펌프카를', '펌프카를 사용하는', '펌프카의', '펌프카의 붐을', '필요한', '필요한 조치를', '하여', '하여 안전난간', '한다', '한다 작업', '호스의', '호스의 요동ㆍ선회로'], Title='파이프 서포트 동바리 안전작업 지침', g320=1.1377594934192192, g5576=8122, g8668=8122, g8941=4950)}, {'n4': Node('Content', Category='콘크리트 타설작업 준수사항', Content='관리감독자는 거푸집 동바리의 이상 징후를 보고 받은 경우 작업을 즉시 작업 을 중지하고 근로자를 대피시킨 다음 충분히 보강 조치하여 안전을 확인한 다 음 작업을 재개하여야 한다', Index=['거푸집', '거푸집 동바리의', '경우', '경우 작업을', '관리감독자는', '관리감독자는 거푸집', '근로자를', '근로자를 대피시킨', '대피시킨', '대피시킨 충분히', '동바리의', '동바리의 징후를', '받은', '받은 경우', '보강', '보강 조치하여', '보고', '보고 받은', '안전을', '안전을 확인한', '작업', '작업 중지하고', '작업을', '작업을 작업', '작업을 재개하여야', '재개하여야', '재개하여야 한다', '조치하여', '조치하여 안전을', '중지하고', '중지하고 근로자를', '징후를', '징후를 보고', '충분히', '충분히 보강', '한다', '확인한', '확인한 작업을'], Title='파이프 서포트 동바리 안전작업 지침', g320=1.0324045709364087, g5576=8120, g8668=8120, g8941=4950)}, {'n4': Node('Content', Category='동바리 해체작업 준수사항', Content='거푸집 동바리의 해체 시기는 설계도서상의 거푸집 존치기간이나 거푸집 해체 가능 강도를 준수하여 해체하여야 한다.', Index=['가능', '가능 강도를', '강도를', '강도를 준수하여', '거푸집', '거푸집 동바리의', '거푸집 존치기간이나', '거푸집 해체', '동바리의', '동바리의 해체', '설계도서상의', '설계도서상의 거푸집', '시기는', '시기는 설계도서상의', '존치기간이나', '존치기간이나 거푸집', '준수하여', '준수하여 해체하여야', '한다', '해체', '해체 가능', '해체 시기는', '해체하여야', '해체하여야 한다'], Title='파이프 서포트 동바리 안전작업 지침', g320=1.0324045709364087, g5576=8124, g8668=8124, g8941=4950)}, {'n4': Node('Content', Category='동바리 조립작업 준수사항', Content='거푸집 동바리는 시공전 조립ㆍ콘크리트 타설ㆍ해체 계획과 안전시공 절차 등 시공계획을 수립하여야 한다.', Index=['거푸집', '거푸집 동바리는', '계획과', '계획과 안전시공', '동바리는', '동바리는 시공전', '수립하여야', '수립하여야 한다', '시공계획을', '시공계획을 수립하여야', '시공전', '시공전 조립ㆍ콘크리트', '안전시공', '안전시공 절차', '절차', '절차 시공계획을', '조립ㆍ콘크리트', '조립ㆍ콘크리트 타설ㆍ해체', '타설ㆍ해체', '타설ㆍ해체 계획과', '한다'], Title='파이프 서포트 동바리 안전작업 지침', g320=1.0324045709364087, g5576=8104, g8668=8104, g8941=4950)}]\n",
      "[5760, 5601, 4930, 5314, 4868, 5029, 5087, 5161, 5834, 5196, 5530, 5457, 4950, 4982, 5814, 5786, 5182, 4767]\n"
     ]
    }
   ],
   "source": [
    "# Retrieve nodes from the graph based on the query\n",
    "query = f'''MATCH (n1:Index{{name:\"{index}\"}})--(n2:Content)--(n3:Category)--(n4:Content{{Title:\"{title}\"}})\n",
    "return n4'''\n",
    "result = graph.run(query).data()\n",
    "\n",
    "\n",
    "unique_nodes = list({node['n4']['Content']: node for node in result}.values())\n",
    "\n",
    "print(unique_nodes)\n",
    "\n",
    "# Get unique nodes based on their content property\n",
    "louvain_list = []\n",
    "\n",
    "for node in result:\n",
    "    if node['n4'].get(f'{graph2}', 0) != 0:\n",
    "        louvain_list.append(node['n4'][f'{graph2}'])\n",
    "\n",
    "louvain_list = list(set(louvain_list))\n",
    "print(louvain_list)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "8d680125",
   "metadata": {
    "scrolled": false,
    "ExecuteTime": {
     "end_time": "2023-07-20T06:30:52.121929800Z",
     "start_time": "2023-07-20T06:30:52.111792900Z"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "--------------------------------\n",
      "--------------------------------\n",
      "--------------------------------\n",
      "--------------------------------\n",
      "--------------------------------\n",
      "해체 시기⋅범위 및 절차 등의 해체작업 안전계획은 해체작업 근로자에게 교육 하여야 한다\n",
      "거푸집 동바리 해체작업은 작업전 해체 시기 순서 등 해체작업 안전계획을 수 립하여야 한다.\n",
      "--------------------------------\n",
      "--------------------------------\n",
      "--------------------------------\n",
      "--------------------------------\n",
      "--------------------------------\n",
      "--------------------------------\n",
      "콘크리트 타설작업은 작업전 청소 실시하고 조립도 준수 여부를 확인하여야 한 다.\n",
      "--------------------------------\n",
      "파이프 서포트 동바리는 구조를 검토한 후 조립도를 작성하고, 조립도에 따라 조 립하여야 한다\n",
      "경사면 하부에 조립하는 거푸집 동바리는 다음 사항을 준수하여야 한다. 가. 거푸집의 형상에 따른 부득이한 경우를 제외하고는 깔판ㆍ깔목 등을 2단 이상 끼우지 않도록 할 것 나. 깔판ㆍ깔목 등을 이어서 사용하는 경우에는 깔판ㆍ깔목은 단단히 연결할 것 다. 경사면에 설치하는 동바리는 연직도를 유지하도록 깔판ㆍ깔목 등으로 고정할 것 라. 연직하게 설치되는 동바리는 경사면방향 분력으로 인하여 미끄러짐 및 전도가 발생할 수 있으므로 모든 동바리에 가새를 설치하는 등 안전조치할 것.\n",
      "개구부 상부에 동바리를 설치하는 경우에는 상부하중을 견딜 수 있는 견고한 받침대를 설치하여야 한다.\n",
      "파이프 서포트 동바리는 다음 사항을 준수하여야 한다. 가. 파이프 서포트를 3개 이상 이어서 사용하지 않도록 할 것 나. 파이프 서포트를 이어서 사용하는 경우에는 4개 이상의 볼트 또는 전용철물을 사용하여 이을 것 다. 높이가 3.5미터를 초과하는 경우에는 높이 2미터 이내마다 비계용 강관을 사용  하여 수평연결재를 2개 방향으로 설치하고 수평연결재의 변위를 방지하기 위 하여 비계용 클램프로 체결할 것\n",
      "콘크리트 펌프 또는 콘크리트 펌프카를 사용하는 경우에는 다음 사항을 준수하 여야 한다. 가. 작업 전 콘크리트 펌프용 비계 등 펌프 장비를 점검하고 이상을 발견하면 즉 시 보수할 것 나. 작업하는 근로자가 호스의 요동ㆍ선회로 인하여 떨어지는 위험을 방지하기 위 하여 안전난간 설치 또는 안전대 착용 등 떨어짐 방지 등 필요한 조치를 할 것 다. 콘크리트 펌프카의 붐을 조정하는 경우에는 주변의 전선 등에 의한 위험을 예 방하기 위한 적절한 조치를 할 것 라. 작업 중에 지반의 침하, 아웃트리거의 손상 등에 의하여 콘크리트 펌프카가 넘 어질 우려가 있는 경우에는 이를 방지하기 위한 적절한 조치를 할 것\n",
      "지반에 설치하는 동바리는 강우로 인하여 토사가 씻겨나가지 않도록 보호하여 야 한다.\n",
      "거푸집 동바리는 시공전 조립ㆍ콘크리트 타설ㆍ해체 계획과 안전시공 절차 등 시공계획을 수립하여야 한다.\n",
      "거푸집 동바리의 해체 시기는 설계도서상의 거푸집 존치기간이나 거푸집 해체 가능 강도를 준수하여 해체하여야 한다.\n",
      "관리감독자는 거푸집 동바리의 이상 징후를 보고 받은 경우 작업을 즉시 작업 을 중지하고 근로자를 대피시킨 다음 충분히 보강 조치하여 안전을 확인한 다 음 작업을 재개하여야 한다\n",
      "재료, 기구 또는 공구 등을 올리거나 내리는 경우에는 건설장비 사용을 원착으로 하며, 부치나 길이가 작은 재료, 기구 또는 공구 등은 양중함이나 달줄ㆍ달포대 등을 사용하도록 하여야 한다.\n",
      "콘크리트 타설작업은 작업전 거푸집 동바리의 변형ㆍ변위 및 지반의 침하 유무 등을 점검하고 이상이 있으면 보수하여야 한다\n",
      "동절기 및 해빙기에 콘크리트 타설하는 경우에는 동바리가 동결된 지반 상부에 직접 설치되어졌는지를 확인하여 침하 등의 우려가 있는 경우 보수하여야 한다.\n",
      "재료, 기구 또는 공구 등을 올리거나 내리는 소운반 작업은 근로자로 하여금 달 줄ㆍ달포대 등을 사용하도록 하여야 한다.\n",
      "강관 파이프 서포트 동바리로 대체하여 사용하는 경우에는 다음 사항을 준수하 여야 한다. 가. 높이 2미터 이내마다 수평연결재를 2개 방향으로 설치하고 수평연결재의 변위 를 방지할 것 나. 멍에 등을 상단에 올릴 경우에는 해당 상단에 강재의 단판을 붙여 멍에 등을 고정시킬 것\n",
      "--------------------------------\n",
      "--------------------------------\n",
      "--------------------------------\n",
      "--------------------------------\n",
      "--------------------------------\n",
      "거푸집 동바리에 사용하는 동바리ㆍ멍에 등 주요 부분의 강재는 산업안전보건 기준에관한 규칙 별표 10의 기준에 적합한 것을 사용하여야 한다.\n",
      "파이프 서포트 동바리 재료는 고용노동부고시 제2020-33호(방호장치 안전인증 고시)에 적합한 것을 사용하여야 한다\n",
      "재사용하는 파이프 서포트 동바리는 건설기술진흥법 제55조(건설공사의 품질관 리)에 적합한 것을 사용하여야 한다\n",
      "--------------------------------\n"
     ]
    }
   ],
   "source": [
    "# Print nodes grouped by Louvain values\n",
    "for i in louvain_list:\n",
    "    group_0 = [node for node in result if node['n4'][f'{graph2}'] == i]\n",
    "    group_0_sorted = sorted(group_0, key=lambda node: node['n4'].get(f'{graph1}', 0), reverse=True)\n",
    "    unique_nodes = set()\n",
    "    for node in group_0_sorted:\n",
    "        if node['n4'].get(f'{graph2}') is not None and node['n4'][f'{graph2}'] >= 0.9:\n",
    "            unique_nodes.add(node['n4']['Content'])\n",
    "    iteration = 0\n",
    "    for node in unique_nodes:\n",
    "        iteration += 1\n",
    "        if iteration >= 2:\n",
    "            print(node)\n",
    "    print('--------------------------------')\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "1c45bd28",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2023-07-20T06:31:18.137423500Z",
     "start_time": "2023-07-20T06:31:18.088180200Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": "(No data)",
      "text/html": "(No data)"
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Remove graph properties from the nodes\n",
    "query1 = f'''MATCH (n:content) REMOVE n.{graph1}'''\n",
    "query2 = f'''MATCH (n:content) REMOVE n.{graph2}'''\n",
    "\n",
    "graph.run(query1)\n",
    "graph.run(query2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "03dd34a8",
   "metadata": {
    "scrolled": false,
    "ExecuteTime": {
     "end_time": "2023-07-20T06:31:18.837798300Z",
     "start_time": "2023-07-20T06:31:18.776711800Z"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " graphName | database | memoryUsage | sizeInBytes | nodeCount | relationshipCount | configuration                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           |            density | creationTime                                    | modificationTime                                | schema                                                                                                                                          | schemaWithOrientation                                                                                                                                                                \r\n",
      "-----------|----------|-------------|-------------|-----------|-------------------|---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|--------------------|-------------------------------------------------|-------------------------------------------------|-------------------------------------------------------------------------------------------------------------------------------------------------|--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r\n",
      " g320      | neo4j    |             |          -1 |        38 |              1194 | {relationshipQuery: 'MATCH (n4)-[r:Relate]-(n5:Content{Title:\"\\ud30c\\uc774\\ud504 \\uc11c\\ud3ec\\ud2b8 \\ub3d9\\ubc14\\ub9ac \\uc548\\uc804\\uc791\\uc5c5 \\uc9c0\\uce68\"}) RETURN id(n4) AS source, id(n5) AS target, type(r) AS type, count(r) AS numberOfReads', jobId: 'ba3dad4e-38a3-48cd-a4d8-3536d9ac7efb', creationTime: datetime('2023-07-20T15:29:29.531575300+09:00'), validateRelationships: false, nodeQuery: 'MATCH (n1:Index{name:\"\\uac70\\ud478\\uc9d1\"})--(n2:Content)--(n3:Category)--(n4:Content{Title:\"\\ud30c\\uc774\\ud504 \\uc11c\\ud3ec\\ud2b8 \\ub3d9\\ubc14\\ub9ac \\uc548\\uc804\\uc791\\uc5c5 \\uc9c0\\uce68\"}) RETURN id(n4) AS id', logProgress: true, sudo: true, readConcurrency: 4, parameters: []} | 0.8492176386913229 | datetime('2023-07-20T15:29:29.531575300+09:00') | datetime('2023-07-20T15:29:29.843240100+09:00') | {graphProperties: {}, relationships: {Relate: {numberOfReads: 'Float (DefaultValue(NaN), TRANSIENT, Aggregation.NONE)'}}, nodes: {__ALL__: {}}} | {graphProperties: {}, relationships: {Relate: {properties: {numberOfReads: 'Float (DefaultValue(NaN), TRANSIENT, Aggregation.NONE)'}, direction: 'DIRECTED'}}, nodes: {__ALL__: {}}} \r\n",
      "\n",
      " graphName | database | memoryUsage | sizeInBytes | nodeCount | relationshipCount | configuration                                                                                                                                                                                           |                density | creationTime                                    | modificationTime                                | schema                                                                               | schemaWithOrientation                                                                                                     \r\n",
      "-----------|----------|-------------|-------------|-----------|-------------------|---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|------------------------|-------------------------------------------------|-------------------------------------------------|--------------------------------------------------------------------------------------|---------------------------------------------------------------------------------------------------------------------------\r\n",
      " g8941     | neo4j    |             |          -1 |      7098 |              1419 | {jobId: 'a0db995a-639a-4675-858b-02d889d61526', creationTime: datetime('2023-07-20T15:29:31.873135500+09:00'), inverseIndexedRelationshipTypes: [], logProgress: true, undirectedRelationshipTypes: []} | 2.8169010729355837e-05 | datetime('2023-07-20T15:29:31.873135500+09:00') | datetime('2023-07-20T15:29:31.893595700+09:00') | {graphProperties: {}, relationships: {Include: {}}, nodes: {Content: {}, Index: {}}} | {graphProperties: {}, relationships: {Include: {properties: {}, direction: 'DIRECTED'}}, nodes: {Content: {}, Index: {}}} \r\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Drop the projected graphs\n",
    "query1 = f\"CALL gds.graph.drop('{graph1}')\"\n",
    "query2 = f\"CALL gds.graph.drop('{graph2}')\"\n",
    "result1 = graph.run(query1)\n",
    "result2 = graph.run(query2)\n",
    "print(result1)\n",
    "print(result2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "95c10741",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
